# `brew bundle install --no-lock` to install/update packages

cask_args appdir: "/Applications"

tap "d12frosted/emacs-plus"

brew "aspell"
brew "awscli"
brew "aws-sam-cli"
brew "cfn-lint"
brew "emacs-plus"
brew "findutils"
brew "ffmpeg"
brew "fish"
brew "git"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "openjdk"
brew "python"
brew "rlwrap"
brew "rsync"
brew "starship"
brew "tree"
brew "wget"

cask "datagrip"
cask "discord"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "postman"
cask "raycast"
cask "visual-studio-code"

# brew "mas"

# mas "iStat Menus", id: 1319778037 
# mas "1Blocker", id: 1107421413
# mas "Day One", id: 1055511498
# mas "Deliveries", id: 924726344
# mas "Due", id: 524373870
# mas "Fantastical", id: 435003921
# mas "GeoTag", id: 1465180184
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Slack", id: 803453959
# mas "Soulver 2", id: 413965349
# mas "StopTheMadness", id: 1376402589
# mas "Tweetbot", id: 1384080005
# mas "Xcode", id: 497799835
# mas "Yoink", id: 457622435

# cask "1Password"
# cask "aerial"
# cask "colloquy"
# cask "droplr"
# cask "handbrake"
# cask "iina"
# cask "imageoptim"
# cask "keepingyouawake"
# cask "makemkv"
# cask "rocket"
# cask "spotify"
# cask "tower"