# `brew bundle install` to install/update packages

cask_args appdir: "/Applications"

tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"
tap "AdoptOpenJDK/openjdk"

brew "aspell"
brew "awscli"
brew "clojure/tools/clojure"
brew "emacs-plus@28"
brew "exa"
brew "fish"
brew "git"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "node"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "tree"
brew "wget"

cask "adoptopenjdk11"
cask "alfred"
cask "font-fira-code"
cask "font-source-code-pro"
cask "istat-menus"
cask "visual-studio-code"

# brew "mas"

# mas "iStat Menus", id: 1319778037 
# mas "1Blocker", id: 1107421413
# mas "Day One", id: 1055511498
# mas "Deliveries", id: 924726344
# mas "Due", id: 524373870
# mas "Fantastical", id: 435003921
# mas "GeoTag", id: 1465180184
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Slack", id: 803453959
# mas "Soulver 2", id: 413965349
# mas "StopTheMadness", id: 1376402589
# mas "Tweetbot", id: 1384080005
# mas "Xcode", id: 497799835
# mas "Yoink", id: 457622435

# cask "1Password"
# cask "aerial"
# cask "colloquy"
# cask "droplr"
# cask "google-chrome"
# cask "handbrake"
# cask "iina"
# cask "imageoptim"
# cask "keepingyouawake"
# cask "makemkv"
# cask "rocket"
# cask "spotify"
# cask "tower"

# brew "carthage"
# brew "ffmpeg"
# brew "mkvtoolnix"
# brew "mp4v2"
# brew "youtube-dl"
# brew "wget"
# brew "exiftool"
# brew "node"